/*
================================================================================
問題: 977. Squares of a Sorted Array
出典: https://leetcode.com/problems/squares-of-a-sorted-array/description/
================================================================================
*/

// ✅ 自分の解答
/**
 * @param {number[]} nums
 * @return {number[]}
 */
var sortedSquares = function(nums) {
    const squared = nums.map((num) => num ** 2);
    return squared.sort((a, b) => a - b);
};

/*
--------------------------------------------------------------------------------
📝 学んだこと:
- sortの書き方はお作法的な感じで覚えてしまえば良さそう
--------------------------------------------------------------------------------
*/
