/*
================================================================================
問題: 文字列の長さを計算する関数を作成せよ💪
出典: https://jsgym.shiftb.dev/q/Yht3uZMbOD
================================================================================
*/

// ✅ 自分の解答
// ① 引数となる文字列の定義
const inputString = "筋肉";

// ② お題を満たす関数の定義
// 文字列の長さを計算する関数を作成しろ！
const calcLength = (inputString) => inputString.length;

// ③ 関数の実行
// ここに作成した関数を実行して、結果をconsole.logで表示しろ！！
console.log(calcLength(inputString));

// 📘 模範解答
// const countLength = str => str.length;
// const inputString = "筋肉";
// console.log(countLength(inputString)); // 2