/*
================================================================================
問題: 数値を二乗する関数を作ろう
出典: https://jsgym.shiftb.dev/q/VaOePfwdo7
================================================================================
*/

// ✅ 自分の解答
// ① 引数となる数値の定義
const num = 4;

// ② 引数の数値を二乗する関数の定義
// ここで関数を定義してください。
const reg = (num) => num ** 2;

// ③ 関数を呼び出す
// ここで関数の呼び出しと結果の表示を書いてください。
console.log(reg(num));

// 📘 模範解答
// const square = num => num * num;
// const num = 4;
// console.log(square(num)); // 16