/*
================================================================================
問題: 文字列を大文字に変換する関数
出典: https://jsgym.shiftb.dev/q/LAjlf9ed5l
================================================================================
*/

// ✅ 自分の解答
// ① 引数となる定数の定義
const text = 'hello';

// ② 関数の定義
// ここに関数を定義して下さい。
const upperStr = (text) => text.toUpperCase();

// ③ 関数の実行と結果の表示
// ここで関数を実行してconsole.logで結果を確認しましょう。
console.log(upperStr(text));

// 📘 模範解答
// const toUpperCase = (str) => str.toUpperCase();
// const text = 'hello';
// console.log(toUpperCase(text)); // HELLO
