/*
================================================================================
問題: ✨数値の整数チェック関数を作ろ〜！✨
出典: https://jsgym.shiftb.dev/q/x8jDY-gMDT
================================================================================
*/

// ✅ 自分の解答
// ① 引数となる定数の定義
const value = 5.5;

// ② 整数かどうかを判定する関数の定義
// ここに関数のコードを書いてね
const isInteger = (value) => Number.isInteger(value);

// ③ 関数の実行
// ここで関数を呼び出して結果をconsole.logで表示しよう
console.log(isInteger(value));

// 📘 模範解答
// const isInteger = num => Number.isInteger(num);
// const value = 5.5;
// console.log(isInteger(value)); // false

/*
--------------------------------------------------------------------------------
📝 学んだこと:
- isIntegerで整数かどうかを判定することができる
--------------------------------------------------------------------------------
*/
