/*
================================================================================
問題: 偶数か奇数を判定する関数を作ろう
出典: https://jsgym.shiftb.dev/q/nX35DzolYK
================================================================================
*/

// ✅ 自分の解答
// 判定したい数値を定義
const number = 5;

// 偶数・奇数を判定する関数を作成
// ここに関数を定義するコードを書いてください。
const checkOddOrEven = (number) => number % 2 === 0 ? "偶数" : "奇数";

// 作成した関数を実行して結果を表示
// ここに関数の実行コードを書いてください。
console.log(checkOddOrEven(number));

// 📘 模範解答
// const checkParity = num => num % 2 === 0 ? '偶数' : '奇数';
// const number = 5;
// console.log(checkParity(number)); // 奇数
