/*
================================================================================
問題: 文字列の末尾に感嘆符を追加する関数
出典: https://jsgym.shiftb.dev/q/tkKvzXahj9
================================================================================
*/

// ✅ 自分の解答
// ① 引数となる文字列の定義
const text = "こんにちは";

// ② 感嘆符を追加する関数の定義
// ここに関数定義のコードを書いてください。
const addEx = (text) => text + "!";

// ③ 関数の実行と結果の表示
// ここに関数実行とconsole.logのコードを書いてください。
console.log(addEx(text));

// 📘 模範解答
// const addExclamation = (text) => text + "！";
// const result = addExclamation("こんにちは");
// console.log(result); // こんにちは！