/*
================================================================================
問題: 日付から「年」を取り出す関数を作りましょう
出典: https://jsgym.shiftb.dev/q/lqS5ljD1S5
再提出: 必要
================================================================================
*/

// ✅ 自分の解答
// ① 引数となる定数の定義
const myDate = new Date('2023-04-01');

// ② お題を満たす関数の定義
// ここに関数定義のコードを書いてください。
const getYear = (myDate) => myDate.getFullYear();

// ③ 関数の実行
// ここに関数定義のコードを書いてください。
console.log(getYear(myDate));

// 📘 模範解答
// const getYear = date => date.getFullYear();
// const myDate = new Date('2023-04-01');
// console.log(getYear(myDate)); // 2023

/*
--------------------------------------------------------------------------------
📝 学んだこと:
- アロー関数を使用する場合、引数が1つの場合は模範解答のように()を省略できる
--------------------------------------------------------------------------------
*/

/*
================================================================================
問題: 💖配列内の最大の数を見つけ出す関数を作ろう😊
出典: https://jsgym.shiftb.dev/q/kyYu2nKUnf
再提出: 不要
================================================================================
*/

// ✅ 自分の解答
// 配列を定義
data = [3, 6, 2, 15, 1];

// 最大値を求める関数を定義してね
function findMax(array) {
  // ここにコードを書いてね
  return Math.max(...array);
}

// 関数を実行して結果を表示してね
console.log(findMax(data));

// 📘 模範解答
// function findMax(array) {
//   return Math.max(...array);
// }

// const data = [3, 6, 2, 15, 1];
// console.log(findMax(data)); // 15

/*
--------------------------------------------------------------------------------
📝 学んだこと:
- Math.max()の引数には配列を入れることができないため、
  スプレッド構文を使ってカンマ区切りとして値を入れてあげる必要がある
--------------------------------------------------------------------------------
*/

/*
================================================================================
問題: 文章から特定の単語をカウントする関数✨
出典: https://jsgym.shiftb.dev/q/383IfmYZw6
再提出: 必要
================================================================================
*/

// ✅ 自分の解答
//① 文章とカウント対象の単語を定義するよ✨
const text = "このリンゴは甘くて美味しいリンゴでした。";
const word = "リンゴ";

// ② 単語カウント用の関数をここに作ろう😘
const countWord = (text, word) => text.split(word).length - 1;

// ③ 作成した関数の実行結果をconsole.logで確認してね🌟
console.log(countWord(text, word));

// 📘 模範解答
// const countWord = (text, word) => text.split(word).length - 1;
// const text = "このリンゴは甘くて美味しいリンゴでした。";
// const word = "リンゴ";
// console.log(countWord(text, word)); // 2

/*
--------------------------------------------------------------------------------
📝 学んだこと:
- splitは文字列に対して指定した文字で配列に分割することができる
- 配列になるのでlengthやmap、filterを使用することができる
--------------------------------------------------------------------------------
*/
