/*
================================================================================
問題: 🔥筋肉カウント💪 配列内の特定の数値の出現回数を数えろ！
出典: https://jsgym.shiftb.dev/q/1n6AzylF8g
再提出: 必要
================================================================================
*/

// ✅ 自分の解答
// 与えられた配列と数値を基に出現回数をカウントする関数を作成
function countOccurrences(array, number) {
    // ここにコードを書き込め！！
    return array.filter((item) => item === number).length;
}

// 関数をマッスル使って、console.logで出力結果を確認せよ！
console.log(countOccurrences([1, 3, 2, 3, 4, 3], 3));

// 📘 模範解答
// function countOccurrences(array, number) {
//     return array.filter(x => x === number).length;
// }

// console.log(countOccurrences([1, 3, 2, 3, 4, 3], 3)); // 結果は3だ！🔥


/*
--------------------------------------------------------------------------------
📝 学んだこと:
- filter関数では配列の要素に対して指定した値と比較しTrueになった値を配列形式で変換する
- itemに設定した()は引数が1つなので省略することができる
--------------------------------------------------------------------------------
*/
