/*
================================================================================
問題: 入力された数値が正か負かゼロか判定する関数を作ろう！
出典: https://jsgym.shiftb.dev/q/NtXWS1CjQl
================================================================================
*/

// ✅ 自分の解答
// ① 引数となる数値の定義
const num = -5;

// ② お題を満たす関数の定義
// ここに関数定義のコードを書いてください。
const checkNumber = (num) => {
  if (num > 0) {
    return "positive";
  } else if (num < 0) {
    return "negative";
  } else if (num === 0) {
    return "zero";
  }
}

// ③ 関数の実行と結果の表示
// ここに作成した関数を呼び出して、結果をconsole.logで表示しましょう。
console.log(checkNumber(num));

// 📘 模範解答
// const checkNumber = num => num > 0 ? 'positive' : num < 0 ? 'negative' : 'zero';
// const num = -5;
// console.log(checkNumber(num)); // negative

/*
--------------------------------------------------------------------------------
📝 学んだこと:
- 三項演算子を使って解くこともできる
--------------------------------------------------------------------------------
*/
