/*
================================================================================
問題: 数値が偶数か奇数かを判定する関数を作成しましょう
出典: https://jsgym.shiftb.dev/q/xiyl-0Jg4Z
================================================================================
*/

// ✅ 自分の解答
// ① 判定対象の定数を定義
const number = 5;

// ② 偶数・奇数を判定する関数を定義
// ここに判断関数のコードを書いてください
const checkNumber = (number) => number % 2 === 0 ? '偶数' : '奇数';


// ③ 定義した関数を使って結果をconsole.logで表示
// ここに関数実行のコードを書いてください
console.log(checkNumber(number));

// 📘 模範解答
// const checkEvenOdd = n => n % 2 === 0 ? '偶数' : '奇数';
// const number = 5;
// console.log(checkEvenOdd(number)); // 奇数