/*
================================================================================
問題: 数値を3倍にする関数で筋肉も3倍！？💪
出典: https://jsgym.shiftb.dev/q/W725_wVvdN
================================================================================
*/

// ✅ 自分の解答
// ① 引数となる定数の定義
const number = 3;

// ② お題を満たす関数の定義
// ここに関数定義のコードを書いてください。
const multipleNum = (number) => number * 3;

// ③ 関数の実行と結果の表示
// ここに関数を実行して結果をconsole.logで表示してください。
console.log(multipleNum(number));

// 📘 模範解答
// const triple = num => num * 3;
// const number = 3;
// console.log(triple(number)); // 9