/*
================================================================================
問題: 文字列に「さん」を付ける関数
出典: https://jsgym.shiftb.dev/q/ZUV18uojVB
================================================================================
*/

// ✅ 自分の解答
// ① 引数となる定数の定義
const name = "山下";

// ② お題を満たす関数の定義
// ここに関数定義のコードを書いてください。
const addSan = (name) => name + "さん";

// ③ 関数の実行
// ここに関数実行のコードを書いてください。
console.log(addSan(name));

// 📘 模範解答
// const addSan = name => `${name}さん`;
// console.log(addSan("山下")); // 山下さん
