/*
================================================================================
問題: 商品価格に消費税を加算する関数を作ろう
出典: https://jsgym.shiftb.dev/q/CaqiTYJsCT
================================================================================
*/

// ✅ 自分の解答
// 引数となる商品価格の定義
const price = 1000;

// 商品価格に消費税を加算する関数の定義
// ここにコードを書いて下さい
const addTax = (price) => price + (price * 0.1);

// 関数を実行し結果を表示
// ここにコードを書いて下さい
console.log(addTax(price));

// 📘 模範解答
// const addTax = price => price * 1.1;
// console.log(addTax(1000)); // 1100

/*
--------------------------------------------------------------------------------
📝 学んだこと:
- 消費税込みの計算は値段に1.1を加えるだけでよかった
--------------------------------------------------------------------------------
*/
