/*
================================================================================
問題: 配列内の数値をすべて正の数に変換する関数を作りましょう
出典: https://jsgym.shiftb.dev/q/nSDHg5TqMp
================================================================================
*/

// ✅ 自分の解答
// ① 引数となる配列の定義
const numbers = [-3, 5, -1, 0, -4];

// ② 関数の定義
// 与えられた配列内の数値をすべて正の数にして返す関数を定義してください。
const convertNumToAbs = (numbers) => numbers.map((num) => Math.abs(num));

// ③ 関数の実行と結果の表示
// 定義した関数を呼び出し、結果をconsole.logで表示してください。
console.log(convertNumToAbs(numbers));

// 📘 模範解答
// const toAbsoluteArray = arr => arr.map(num => Math.abs(num));
// const numbers = [-3, 5, -1, 0, -4];
// console.log(toAbsoluteArray(numbers)); // [3, 5, 1, 0, 4]

/*
--------------------------------------------------------------------------------
📝 学んだこと:
- Math.absを使うと数値を絶対値に変換することができる
--------------------------------------------------------------------------------
*/
