/*
================================================================================
問題: 文字列の最初の文字を取得する関数を作ろう
出典: https://jsgym.shiftb.dev/q/97i9qnfXkN
================================================================================
*/

// ✅ 自分の解答
// ① 引数として渡す文字列の定数定義
const str = "JavaScript";

// ② 関数の定義
// ここに最初の文字を取得する関数を書いてください。
const getStartChar = (str) => str[0];

// ③ 関数の実行とconsole.logでの表示
// ここで関数を実行し、結果をconsole.logで表示してください。
console.log(getStartChar(str));

// 📘 模範解答
// const getFirstCharacter = str => str.charAt(0);
// const str = "JavaScript";
// console.log(getFirstCharacter(str)); // "J"

/*
--------------------------------------------------------------------------------
📝 学んだこと:
- charAt()でも文字を取得することができる
--------------------------------------------------------------------------------
*/
