/*
================================================================================
問題: 文字列の長さを返す関数を作ろう！✨
出典: https://jsgym.shiftb.dev/q/uQBvApGt39
================================================================================
*/

// ✅ 自分の解答
// ① 引数となる文字列を定義する
const text = "Hello, World!";

// ② ここに関数を定義してね
const getStringLength = (text) => text.length;

// ③ 定義した関数を実行しよう
console.log(getStringLength(text));

// 📘 模範解答
// const getLength = str => str.length;
// const text = "Hello, World!";
// console.log(getLength(text)); // 13

/*
--------------------------------------------------------------------------------
📝 学んだこと:
- lengthはプロパティだからlength()にする必要はない
--------------------------------------------------------------------------------
*/
