/*
================================================================================
問題: 筋肉アップ！数値を5倍にする関数を作ろう💪🔥
出典: https://jsgym.shiftb.dev/q/199SZUkPMF
================================================================================
*/

// ✅ 自分の解答
// 引数となる定数の定義
const number = 4;

// 数値を5倍にして返す関数の定義
// ここに関数定義のコードを書いてください。
const timesFive = (number) => number * 5;

// 関数の実行と結果の表示
// ここに関数実行のコードを書いてください。
console.log(timesFive(number));

// 📘 模範解答
// const quintuple = num => num * 5;
// const number = 4;
// console.log(quintuple(number)); // 20
